fix: text_layout/adapter to prefer straight paths
